In [1]:
import pandas as pd

In [14]:
data = [[1, 'Avengers'], [2, 'Frozen 2'], [3, 'Joker']]
movies = pd.DataFrame(data, columns=['movie_id', 'title']).astype({'movie_id':'Int64', 'title':'object'})
data = [[1, 'Daniel'], [2, 'Monica'], [3, 'Maria'], [4, 'James']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})
data = [[1, 1, 3, '2020-01-12'], [1, 2, 4, '2020-02-11'], [1, 3, 2, '2020-02-12'], [1, 4, 1, '2020-01-01'], [2, 1, 5, '2020-02-17'], [2, 2, 2, '2020-02-01'], [2, 3, 2, '2020-03-01'], [3, 1, 3, '2020-02-22'], [3, 2, 4, '2020-02-25']]
movie_rating = pd.DataFrame(data, columns=['movie_id', 'user_id', 'rating', 'created_at']).astype({'movie_id':'Int64', 'user_id':'Int64', 'rating':'Int64', 'created_at':'datetime64[ns]'})

In [3]:
movies

   movie_id     title
0         1  Avengers
1         2  Frozen 2
2         3     Joker

In [4]:
users

   user_id    name
0        1  Daniel
1        2  Monica
2        3   Maria
3        4   James

In [5]:
movie_rating

   movie_id  user_id  rating created_at
0         1        1       3 2020-01-12
1         1        2       4 2020-02-11
2         1        3       2 2020-02-12
3         1        4       1 2020-01-01
4         2        1       5 2020-02-17
5         2        2       2 2020-02-01
6         2        3       2 2020-03-01
7         3        1       3 2020-02-22
8         3        2       4 2020-02-25

Write a solution to:

* Find the name of the user who has rated the greatest number of movies. In case of a tie, return the lexicographically smaller user name.
* Find the movie name with the highest average rating in February 2020. In case of a tie, return the lexicographically smaller movie name.

The result format is in the following example.

| results      |
|--------------|
| Daniel       |
| Frozen 2     |

In [ ]:
user_rating = movie_rating.groupby(by="user_id")["rating"].count().reset_index()
most_active_users = user_rating.loc[user_rating.rating == user_rating.rating.max()]["user_id"]
most_active_user = users.name.loc[users.user_id.isin(most_active_users)].sort_values(ascending=True).iloc[0]
most_active_user

In [55]:
average_rating = movie_rating.loc[
    (movie_rating.created_at >= pd.to_datetime("2020-02-01")) &
    (movie_rating.created_at <= pd.to_datetime("2020-03-01") - pd.Timedelta(days=1))
].groupby(by="movie_id")["rating"].mean().reset_index()

highest_rating_movie = average_rating.movie_id.loc[(average_rating.rating == average_rating.rating.max())]
highest_rating_movie_name = movies.title.loc[movies.movie_id.isin(highest_rating_movie)].sort_values(ascending=True).iloc[0]
highest_rating_movie_name

'Frozen 2'

In [57]:
pd.DataFrame(data=[most_active_user,highest_rating_movie_name],columns=["results"])

    results
0    Daniel
1  Frozen 2